Repository: biblibre/omeka-s-module-Search
Catalog: language/*.po
Languages: fr

source: [No adapter]
fr: [Aucun adaptateur]

source: Resources indexed
fr: Ressources indexées

source: Adapter
fr: Adaptateur

source: Save queries
fr: Sauvegarde des requêtes

source: Add ability to save your query and reload it later with result update
fr: Ajoute la possibilité de sauvegarder votre requête et de la recharger avec des résultats actualisés

source: Facet limit
fr: Limite de facette

source: The maximum number of values fetched for each facet
fr: Le nombre maximum de valeurs récupérées pour chaque facette

source: Form settings
fr: Paramètres du formulaire

source: Path
fr: Chemin

source: Form
fr: Formulaire

source: Search everywhere
fr: Rechercher partout

source: Filters
fr: Filtres

source: Resource classes
fr: Classes de ressource

source: Edit facet
fr: Modifier la facette

source: Set facet
fr: Définir la facette

source: Facet to be removed
fr: Facette à supprimer

source: Remove facet
fr: Supprimer la facette

source: Restore facet
fr: Restaurer la facette

source: Edit form element
fr: Modifier un élément de formulaire

source: Set form element
fr: Définir un élément de formulaire

source: Form element to be removed
fr: Élément de formulaire à supprimer

source: Remove form element
fr: Supprimer l'élément de formulaire

source: Restore form element
fr: Restaurer l'élément de formulaire

source: Search configuration
fr: Configuration de la recherche

source: Add new index
fr: Ajouter un index

source: Rebuild index
fr: Reconstruire l'index

source: No search indexes created yet.
fr: Aucun index de recherche créé pour l'instant.

source: No search pages created yet.
fr: Aucune page de recherche créée pour l'instant.

source: Edit search field
fr: Modifier le champ de recherche

source: Set search field
fr: Definir le champ de recherche

source: Search field to be removed
fr: Champ de recherche à supprimer

source: Remove search field
fr: Supprimer le champ de recherche

source: Restore search field
fr: Restaurer le champ de recherche

source: Add search index
fr: Ajouter un index de recherche

source: Configure search index
fr: Configure l'index de recherche

source: Save configuration
fr: Enregistrer la configuration

source: Index rebuild
fr: Reconstruction de l'index

source: Start index rebuild
fr: Commencer la reconstruction de l'index

source: Add search page
fr: Ajouter une page de recherche

source: Configure search page
fr: Configurer la page de recherche

source: Edit search page
fr: Modifier la page de recherche

source: Edit sort field
fr: Modifier champ de tri

source: Set sort field
fr: Définir champ de tri

source: Sort field to be removed
fr: Champ de tri à supprimer

source: Remove sort field
fr: Supprimer le champ de tri

source: Restore sort field
fr: Restaurer le champ de tri

source: Proximity option (e.g. 2)
fr: Option de proximité (ex. 2)

source: Match all of the following criteria:
fr: Correspond à tous les critères suivants:

source: Match any of the following criteria:
fr: Correspond à au moins un des critères suivants:

source: Add filter
fr: Ajouter un filtre

source: Add group
fr: Ajouter un groupe

source: Extracts matching your search
fr: Extraits correspondant à votre recherche

source: Show more
fr: Voir plus

source: Show less
fr: Voir moins

source: Edit search
fr: Modifier la recherche

source: Your query returned no results
fr: Votre recherche n'a retourné aucun résultat

source: Save this query
fr: Sauvegarder cette requête

source: Reload
fr: Recharger

source: Delete this saved query
fr: Supprimer cette requête sauvegardée

source: None saved queries yet
fr: Aucune requête sauvegardée

source: Fallback
fr: Par défaut

source: Value renderer
fr: Moteur de rendu

source: The value renderer changes how a facet value is displayed to users. It is useful when the indexed value is an internal id or code that can be associated to a human-friendly text. The default renderer shows the indexed value as is.
fr: Le moteur de rendu de valeur modifie la façon dont une valeur de facette est affichée aux utilisateurs. C'est utile lorsque la valeur indexée est un identifiant interne ou un code qui peut être associé à un texte compréhensible facilement. Le moteur de rendu par défaut affiche la valeur indexée telle quelle.

source: Search fields
fr: Champs de recherche

source: Add a search field
fr: Ajouter un champ de recherche

source: Proximity
fr: Proximité

source: Add proximity option on search form to choose distance between terms
fr: Ajoutez une option de proximité sur le formulaire de recherche pour choisir la distance entre les termes

source: Form elements
fr: Éléments de formulaire

source: Add a form element
fr: Ajouter un élément de formulaire

source: Show search summary
fr: Afficher le résumé de la recherche

source: Show a summary of user search query near the results.
fr: Affiche un résumé de la recherche utilisateur à proximité des résultats.

source: Facets
fr: Facettes

source: Add a facet
fr: Ajouter une facette

source: Sort fields
fr: Champs de tri

source: Add a sort field
fr: Ajouter un champ de tri

source: Clear index
fr: Nettoyer l'index

source: Empty the index before rebuilding it
fr: Vider l'index avant de le reconstruire

source: Batch size
fr: Taille de lot

source: Index that much resources at once. Large batchs will be faster but will use more memory
fr: Indexer cette quantité de ressources par lot. Une grande taille de lot sera plus rapide, mais utilisera plus de mémoire

source: Index rebuilding started in %sjob %s%s
fr: La reconstruction de l'index a commencé dans %sla tâche %s%s

source: Saved Queries
fr: Requêtes sauvegardées

source: Label for this block
fr: Libellé pour ce bloc

source: Resource class
fr: Classe de ressource

source: Field
fr: Champ

source: Field to use for filtering. It should be a facet field.
fr: Champ à utiliser pour le filtrage. Cela devrait être un champ de facettes.
